<?php

use yii\helpers\Html;
use yii\widgets\ActiveForm;
use unclead\multipleinput\MultipleInput;

/* @var $this yii\web\View */
/* @var $model app\models\Schedule */
/* @var $form yii\widgets\ActiveForm */
?>

<p>
<label for="">Выбрать сайт: </label>
       <?php foreach(\yii\helpers\ArrayHelper::map(\app\models\Site::find()->all(), 'id', 'url') as $key => $value){
        echo Html::a($value, '/admin/schedule/update/?site_id='.$key)."<br>";
        } ?>
    </p>

<div class="schedule-form">
<?php 

$times = [
"-11" => "UTC -11:00",
"-10" => "UTC -10:00",
"-9" => "UTC -09:00",
"-8" => "UTC -08:00",
"-7" => "UTC -07:00",
"-6" => "UTC -06:00",
"-5" => "UTC -05:00",
"-4" => "UTC -04:00",
"-3" => "UTC -03:00",
"-2" => "UTC -02:00",
"-1" => "UTC -01:00",
"0" => "UTC 00:00",
"1" => "UTC +01:00",
"2" => "UTC +02:00",
"3" => "UTC +03:00",
"4" => "UTC +04:00",
"5" => "UTC +05:00",
"6" => "UTC +06:00",
"7" => "UTC +07:00",
"8" => "UTC +08:00",
"9" => "UTC +09:00",
"10" => "UTC +10:00",
"11" => "UTC +11:00",
"12" => "UTC +12:00",
"13" => "UTC +13:00",
"14" => "UTC +14:00"
];

$regions = ["Адыгея" => "Адыгея","Алтай" => "Алтай","Алтайский край" => "Алтайский край","Амурская область" => "Амурская область","Архангельская область" => "Архангельская область","Астраханская область" => "Астраханская область","Башкортостан" => "Башкортостан","Белгородская область" => "Белгородская область","Брянская область" => "Брянская область","Бурятия" => "Бурятия","Владимирская область" => "Владимирская область","Волгоградская область" => "Волгоградская область","Вологодская область" => "Вологодская область","Воронежская область" => "Воронежская область","Дагестан" => "Дагестан","Еврейская автономная область" => "Еврейская автономная область","Забайкальский край" => "Забайкальский край","Ивановская область" => "Ивановская область","Ингушетия" => "Ингушетия","Иркутская область" => "Иркутская область","Кабардино-Балкария" => "Кабардино-Балкария","Калининградская область" => "Калининградская область","Калмыкия" => "Калмыкия","Калужская область" => "Калужская область","Камчатский край" => "Камчатский край","Карачаево-Черкессия" => "Карачаево-Черкессия","Карелия" => "Карелия","Кемеровская область" => "Кемеровская область","Кировская область" => "Кировская область","Коми" => "Коми","Костромская область" => "Костромская область","Краснодарский край" => "Краснодарский край","Красноярский край" => "Красноярский край","Курганская область" => "Курганская область","Курская область" => "Курская область","Крым" => "Крым","Ленинградская область" => "Ленинградская область","Липецкая область" => "Липецкая область","Магаданская область" => "Магаданская область","Марий Эл" => "Марий Эл","Мордовия" => "Мордовия","Москва" => "Москва","Московская область" => "Московская область","Мурманская область" => "Мурманская область","Ненецкий АО" => "Ненецкий АО","Нижегородская область" => "Нижегородская область","Новгородская область" => "Новгородская область","Новосибирская область" => "Новосибирская область","Омская область" => "Омская область","Оренбургская область" => "Оренбургская область","Орловская область" => "Орловская область","Пензенская область" => "Пензенская область","Пермский край" => "Пермский край","Приморский край" => "Приморский край","Псковская область" => "Псковская область","Ростовская область" => "Ростовская область","Рязанская область" => "Рязанская область","Самарская область" => "Самарская область","Санкт-Петербург" => "Санкт-Петербург","Саратовская область" => "Саратовская область","Саха (Якутия)" => "Саха (Якутия)","Сахалинская область" => "Сахалинская область","Свердловская область" => "Свердловская область","Северная Осетия" => "Северная Осетия","Смоленская область" => "Смоленская область","Ставропольский край" => "Ставропольский край","Тамбовская область" => "Тамбовская область","Татарстан" => "Татарстан","Тверская область" => "Тверская область","Томская область" => "Томская область","Тульская область" => "Тульская область","Тыва" => "Тыва","Тюменская область" => "Тюменская область","Удмуртия" => "Удмуртия","Ульяновская область" => "Ульяновская область","Хабаровский край" => "Хабаровский край","Хакасия" => "Хакасия","Ханты-Мансийский автономный округ - Югра" => "Ханты-Мансийский автономный округ - Югра","Челябинская область" => "Челябинская область","Чечня" => "Чечня","Чувашия" => "Чувашия","Чукотский автономный округ" => "Чукотский автономный округ","Ямало-Ненецкий АО" => "Ямало-Ненецкий АО","Ярославская область" => "Ярославская область"]; ?>


    <?php $form = ActiveForm::begin(); ?>

     <?php
        $model = new app\models\Schedule(); 
        $rule = app\models\Rule::findOne(['id'=>Yii::$app->request->get('site_id', 1)]);
        $model->rule_id = 1;
        //$rule->timezone = 'UTC +03:00';
         ?>

    <div class="row">
        <div class="col-md-6">
            <?=$form->field($rule, 'timezone')->dropDownList($times)?>
        </div>
        <div class="col-md-6">
            <?=$form->field($rule, 'regions')->dropDownList($regions)?>
            <?=$form->field($rule, 'show_everywhere')->checkbox()?>
        </div>
    </div>

    <?= $form->field($model, 'params')->widget(MultipleInput::className(), [
        'data'=> app\models\Schedule::findAll(['rule_id'=>1]),
        'columns' => [
        [
            'name'  => 'day',
            'type'  => 'dropDownList',
            'title' => 'День недели',
            'defaultValue' => 0,
            'items' => [
                1=>'ПН',
                2=>'ВТ',
                3=>'СР',
                4=>'ЧТ',
                5=>'ПТ',
                6=>'СБ',
                7=>'ВС',
            ]
        ],
        [
            'name'  => 'start_time',
            'title' => 'Начало работы',
            'type'=>'dropDownList',
            'defaultValue'=>0,
            'items'=>range(0,23),
        ],
        [
            'name'  => 'end_time',
            'title' => 'Конец работы',
            'type'=>'dropDownList',
            'defaultValue'=>23,
            'items'=>range(0,23),
        ],
        [
            'name'  => 'no_break',
            'title' => 'Без обеда',
            'type'  => 'checkbox',
            'defaultValue'=>1,
        ],
        [
            'name'  => 'lunch_start',
            'title' => 'Начало обеда',
            'type'=>'dropDownList',
            'defaultValue'=>0,
            'items'=>range(0,23),
        ],
        [
            'name'  => 'lunch_end',
            'title' => 'Конец обеда',
            'type'=>'dropDownList',
            'defaultValue'=>23,
            'items'=>range(0,23),
        ],
        [
            'name'  => 'no_break',
            'title' => 'Круглосуточно',
            'type'  => 'checkbox',
            'defaultValue'=>1,
        ],
    ]
 ]);
?>

    <div class="form-group">
        <?= Html::submitButton(Yii::t('app', 'Save'), ['class' => 'btn btn-success']) ?>
    </div>

    <?php ActiveForm::end(); ?>

</div>
